      ******************************************************************
       identification division.
       program-id.template.
      * author: blake bartenbach
      ******************************************************************

      ******************************************************************
       environment division.
      ******************************************************************

      ******************************************************************
       data division.
      ******************************************************************

      ******************************************************************
       procedure division.
        
       100-main.
         stop run.
      ******************************************************************


